#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Sublime/tfc-example-staging/runs/run-zSx6MUmshYTs5PTJ

Waiting for the plan to start...

Terraform v0.12.30
Configuring remote state backend...
Initializing Terraform configuration...
2021/02/25 21:50:04 [DEBUG] Using modified User-Agent: Terraform/0.12.30 TFC/570a84083c
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.tfc_example_table will be created
  + resource "aws_dynamodb_table" "tfc_example_table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UUID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "UUID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled = (known after apply)
        }
    }

  # random_pet.table_name will be created
  + resource "random_pet" "table_name" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @SublimeYohan, Action: `pull_request`*